Revit 2027 API
PanelScheduleView.GetPanel Method
 Gets the panel for this view
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetPanel()
Public Function GetPanel As ElementId
public:
ElementId^ GetPanel()
member GetPanel : unit -> ElementId
Return Value
ElementId
 The id of the panel for this view
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace